Extensions/BankOperationsUpload/Documents/Расход.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Document>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>Расход</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ОперацияПроверена</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ОписаниеОперации</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>КошелекДолг</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.ВидыСубконто</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ФинансоваяЦельОткуда</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФинансовыеЦели</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>СуммаЧека</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>СостояниеРасходаПоЧеку</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СостоянияРасходаПоЧеку</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ОписаниеПроблемы</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>СуммаСкидки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>QRКод</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1000</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>money_ЗагруженИзНалоговой</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>money_НоменклатураОбработана</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>money_РасходыЗаполненыПоНоменклатуре</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>money_Отладка</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>money_Номенклатура</Name>
					<Comment>https://github.com/Denis-Shaymardanov/Money/issues/4</Comment>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>НоменклатураПоставщика</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.money_НоменклатураПоставщиков</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.money_Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтатьяРасходов</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СтатьиРасходов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Расходы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>ФинансоваяЦель</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ФинансовыеЦели</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>СтатьяРасходаИмущество</Name>
							<Type>
								<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>СкидкаВведенаВручную</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Скидка</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>КомментарийСтроки</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Extensions/BankOperationsUpload/Documents/Расход/Forms/ФормаДокумента/Ext/Form/Module.bsl
&НаСервере
Процедура money_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
		
	Если НЕ Объект.money_НоменклатураОбработана И НЕ ЕстьНоменклатураСПустымиРасходами() Тогда
		Объект.money_НоменклатураОбработана = Истина; 
	КонецЕсли; 
	
	money_УправлениеФормой();	
	
КонецПроцедуры 

&НаКлиенте
Процедура money_ПослеЗаписиПосле(ПараметрыЗаписи)   
	
	money_УправлениеФормой();
	
КонецПроцедуры

&НаСервере
Процедура money_УправлениеФормой()

	УстановитьДоступностьЗагрузкиИзНалоговой();   
	УстановитьДоступностьЗаполненияРасходовПоНоменклатуре();	
	
КонецПроцедуры  

&НаСервере
Процедура УстановитьДоступностьЗагрузкиИзНалоговой()   
	
	ДоступнаЗагрузкаИзНалоговой				 = НЕ Объект.money_ЗагруженИзНалоговой;
	
	Элементы.QRКод.Доступность = ДоступнаЗагрузкаИзНалоговой;
	Элементы.Форма_ЗагрузитьДанныеЧекаИзНалоговой.Доступность = ДоступнаЗагрузкаИзНалоговой; 
		
КонецПроцедуры  

&НаСервере
Процедура УстановитьДоступностьЗаполненияРасходовПоНоменклатуре()   
	
	ДоступноЗаполнениеРасходовПоНоменклатуре = НЕ Объект.money_РасходыЗаполненыПоНоменклатуре;
	Элементы.Расходы_ЗаполнитьРасходыПоНоменклатуре.Доступность = ДоступноЗаполнениеРасходовПоНоменклатуре;
		
КонецПроцедуры

&НаКлиенте
Процедура money_ЗагруженИзНалоговойПриИзмененииПосле(Элемент)
	
	money_УправлениеФормой();
	
КонецПроцедуры

&НаКлиенте
Процедура money_РасходыЗаполненыПоНоменклатуреПриИзмененииПосле(Элемент)

	money_УправлениеФормой();

КонецПроцедуры
//////////////////////////////////<<ЗАГРУЗКА ЧЕКА ИЗ НАЛОГОВОЙ/////////////////////////////////////////////////
&НаКлиенте
Процедура ЗагрузитьДанныеЧекаИзНалоговойПосле(Команда)
	
	Если ЗагрузитьДанныеЧекаИзНалоговойНаСервере() Тогда
		money_УправлениеФормой();
		Сообщить("Данные успешно загружены");		
	КонецЕсли;

КонецПроцедуры     

&НаСервере
Функция ЗагрузитьДанныеЧекаИзНалоговойНаСервере()
		
	Если НЕ ПроверитьЗаполнениеПараметровПодключения() Тогда 
		Возврат Ложь;		
	КонецЕсли;
	
	//Основной алгоритм находится в модуле объекта
	ДокументОбъект = РеквизитФормыВЗначение("Объект", Тип("ДокументОбъект.Расход"));
	Результат = ДокументОбъект.ЗагрузитьДанныеЧекаИзНалоговой();
	ЗначениеВРеквизитФормы(ДокументОбъект, "Объект");
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Функция ПроверитьЗаполнениеПараметровПодключения() 
	
	Результат = Истина;
	
	Если НЕ ЗначениеЗаполнено(Константы.ТокенПроверкаЧеков.Получить()) Тогда
		ТекстОшибки = "Укажите токен подключения к сервису проверки чеков";	
		ОбщегоНазначения.СообщитьПользователю(ТекстОшибки); 
		Результат = Ложь;
	КонецЕсли;   
	
	Возврат Результат;
	
КонецФункции
//////////////////////////////////ЗАГРУЗКА ЧЕКА ИЗ НАЛОГОВОЙ>>/////////////////////////////////////////////////

//////////////////////////////////<<РАБОТА С НОМЕНКЛАТУРОЙ/////////////////////////////////////////////////
&НаКлиенте
Процедура ЗаполнитьНоменклатуруПоНоменклатуреПоставщика(Команда)
	ЗаполнитьНоменклатуруПоНоменклатуреПоставщикаНаСервере();
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьНоменклатуруПоНоменклатуреПоставщикаНаСервере()

	Для Каждого Стр Из Объект.Номенклатура Цикл
		Стр.Номенклатура = Стр.НоменклатураПоставщика.Номенклатура;		
		
		Если Стр.Номенклатура.Пустая() Тогда
			Продолжить;			
		КонецЕсли;     
		
		Стр.СтатьяРасходов	= Стр.Номенклатура.СтатьяРасходов;				
	КонецЦикла;        
	
	Модифицированность = Истина;

КонецПроцедуры

&НаКлиенте
Процедура money_ЗаполнитьРасходыПоНоменклатуреПосле(Команда)

	ЗаполнитьРасходыПоНоменклатуреНаСервере();
	money_УправлениеФормой();

КонецПроцедуры 

&НаСервере
Процедура ЗаполнитьРасходыПоНоменклатуреНаСервере()
		
	Если Объект.money_Номенклатура.Количество() = 0 Тогда                     
		ТекстСообщения = "В табличной части 'Номенклатура' нет строк. Операция не будет выполнена!";
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
		Возврат;		
	КонецЕсли;
			
	Если ЕстьНоменклатураСПустымиРасходами() Тогда              
		ТекстСообщения = "В табличной части 'Номенклатура' не во всех строках заполнены статьи расходов. Операция не будет выполнена!";
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
		Возврат;		
	КонецЕсли;      
	
	Если Объект.Расходы.Итог("Сумма") <> Объект.money_Номенклатура.Итог("Сумма") Тогда
		ТекстСообщения = "Расходятся суммы в табличных частях. Операция не будет выполнена!";
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
		Возврат;
	КонецЕсли;
	
	ТаблицаПоСтатьямРасходов = Объект.money_Номенклатура.Выгрузить();
	ТаблицаПоСтатьямРасходов.Свернуть("СтатьяРасходов", "Сумма");
	
	Объект.Расходы.Очистить();	
	
	Для Каждого Стр Из ТаблицаПоСтатьямРасходов Цикл
		НоваяСтрока = Объект.Расходы.Добавить();
		НоваяСтрока.СтатьяРасходаИмущество = Стр.СтатьяРасходов; 
		НоваяСтрока.Сумма = Стр.Сумма;
	КонецЦикла;       
	
	Объект.money_РасходыЗаполненыПоНоменклатуре = Истина; 
		
КонецПроцедуры   

&НаСервере
Функция ЕстьНоменклатураСПустымиРасходами() 
	
	Если Объект.money_Номенклатура.Количество() = 0 Тогда
		Возврат Истина;		
	КонецЕсли;

	Возврат Объект.money_Номенклатура.НайтиСтроки(
		Новый Структура("СтатьяРасходов", Справочники.СтатьиРасходов.ПустаяСсылка())).Количество() > 0;
		
КонецФункции

&НаКлиенте
Процедура money_НоменклатураНоменклатураПриИзмененииПосле(Элемент)

	ТекущиеДанные = Элементы.money_Номенклатура.ТекущиеДанные;
	ТекущиеДанные.СтатьяРасходов = ОбщегоНазначенияВызовСервера.ЗначениеРеквизитаОбъекта(ТекущиеДанные.Номенклатура, "СтатьяРасходов");

КонецПроцедуры

&НаКлиенте
Процедура money_НоменклатураПриИзмененииПосле(Элемент)

	Объект.money_НоменклатураОбработана = НЕ ЕстьНоменклатураСПустымиРасходами(); 	

КонецПроцедуры

&НаКлиенте
Процедура money_НоменклатураНоменклатураПоставщикаПриИзмененииПосле(Элемент)

	ТекущиеДанные = Элементы.money_Номенклатура.ТекущиеДанные;
	ТекущиеДанные.Номенклатура = ОбщегоНазначенияВызовСервера.ЗначениеРеквизитаОбъекта(ТекущиеДанные.НоменклатураПоставщика, "Номенклатура"); 
	ТекущиеДанные.СтатьяРасходов = ОбщегоНазначенияВызовСервера.ЗначениеРеквизитаОбъекта(ТекущиеДанные.Номенклатура, "СтатьяРасходов");
	
КонецПроцедуры
//////////////////////////////////РАБОТА С НОМЕНКЛАТУРОЙ>>/////////////////////////////////////////////////
